GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Src/fm33lr0xx_fl_flash.c
  *         -FL_FAIL 擦写发生错误
  *         -FL_PASS 擦写成功
  */
FL_ErrorStatus FL_FLASH_Read_Dma(FLASH_Type *FLASHx, uint32_t address, uint32_t *data, uint32_t length)
{
    FL_ErrorStatus ret = FL_PASS;
    uint32_t Timeout;
    FL_DMA_InitTypeDef DMA_InitStruct = {0};
    /* 入口参数检查 */
    assert_param(IS_FLASH_ALL_INSTANCE(FLASHx));
    assert_param(IS_FL_FLASH_MAX_ADDR(address));
    /* 字对齐*/
    if((address % FL_FLASH_ADDRS_ALIGN) != 0)
    {
        /*地址未对齐*/
        return FL_FAIL;
    }
    /*总线时钟使能*/
    FL_CMU_EnableGroup2BusClock(FL_CMU_GROUP2_BUSCLK_FLASH);
		FL_FLASH_ClearFlag_KeyError(FLASHx);
    /*FLASH工作时钟使能*/
    FL_CMU_EnableOperationClock(FL_CMU_OPCLK_FLASH);
    /* DMA通道配置*/
    DMA_InitStruct.circMode             = FL_DISABLE;
    DMA_InitStruct.direction            = FL_DMA_DIR_FLASH_TO_RAM;
    DMA_InitStruct.memoryAddressIncMode = FL_DMA_CH7_RAM_INC_MODE_INCREASE;
    DMA_InitStruct.flashAddressIncMode  = FL_DMA_CH7_FLASH_INC_MODE_INCREASE;
    DMA_InitStruct.priority             = FL_DMA_PRIORITY_HIGH;
    (void)FL_DMA_Init(DMA, &DMA_InitStruct, FL_DMA_CHANNEL_7);
    if((((uint32_t)FL_DATA_FLASH_ADDR_MINPROGRAM) <=address) && (address < (FL_DATA_FLASH_ADDR_MAXPROGRAM)))
    {
        FL_DMA_SetFlashAddressType(DMA,FL_DMA_FLASH_DATA);
    }
    else
    {
        FL_DMA_SetFlashAddressType(DMA,FL_DMA_FLASH_CODE);    
    }
    FL_DMA_WriteFlashAddress(DMA, address >> 2);
    FL_DMA_WriteMemoryAddress(DMA, (uint32_t)data >> 2, FL_DMA_CHANNEL_7);
    FL_DMA_WriteTransmissionSize(DMA, length - 1, FL_DMA_CHANNEL_7);
    FL_DMA_Enable(DMA);
    FL_DMA_ClearFlag_TransferComplete(DMA, FL_DMA_CHANNEL_7);
    FL_DMA_EnableChannel(DMA, FL_DMA_CHANNEL_7);
    Timeout = 0;
    while(1)
    {
        Timeout++;
        if(Timeout > FL_FLASH_ERASE_TIMEOUT)
        {
            ret = FL_FAIL;
            break;
        }
        if(FL_DMA_IsActiveFlag_TransferComplete(DMA, FL_DMA_CHANNEL_7) == 0X01)
        {
            ret = FL_PASS;
            break;
        }
    }
    FL_DMA_Disable(DMA);
    return ret;
}


/**
  * @}
  */

/* Private function ----------------------------------------------------------*/
/** @defgroup FLASH_FL_Private_Functions FLASH Private Functions
  * @{
  */



/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
